; domain
(define (domain imv-multi-agent)
  (:requirements :strips :typing :negation :disjunctive-preconditions) 
  ;; Rimossi conditional-effects, universal-preconditions e existential-preconditions

  (:types
    location item agent count - object
    robot drone - agent
    artifact pod - item
  )

  (:predicates
    (at ?o - object ?l - location)
    (connected ?l1 ?l2 - location)
    (holding ?a - agent ?i - item)
    (load ?a - agent ?c - count)         
    (next ?c1 ?c2 - count)               
    (capacity-ok ?a - agent ?c - count)  
    (inside ?art - item ?p - item)
    (empty ?p - item)
    (transportable ?i - item)      
    (seismic-active ?l - location) 
    (blocked ?a - agent)       ;; Blocco fisico (oggetto fragile)
    (temp-blocked ?a - agent)  ;; Blocco termico (oggetto caldo)
    (needs-cooling ?a - artifact) 
    (cooled ?a - artifact)        
  )

  ;; --- MOVIMENTO ---
  (:action move-freely
    :parameters (?a - agent ?from ?to - location)
    :precondition (and 
        (at ?a ?from) 
        (connected ?from ?to)
        (load ?a n0) 
    )
    :effect (and (not (at ?a ?from)) (at ?a ?to))
  )

  (:action move-carrying
    :parameters (?a - agent ?from ?to - location)
    :precondition (and 
        (at ?a ?from) 
        (connected ?from ?to)
        (not (load ?a n0)) 
        (not (blocked ?a)) 
        (not (temp-blocked ?a))
    )
    :effect (and (not (at ?a ?from)) (at ?a ?to))
  )

  ;; --- RACCOLTA (SPLIT ACTIONS) ---
  
  ;; Caso 1: Oggetto Standard (Transportable E (Freddo O Già Raffreddato))
  (:action pick-up-standard
    :parameters (?a - agent ?i - item ?l - location ?c_pre ?c_post - count)
    :precondition (and 
        (at ?a ?l) (at ?i ?l)
        (load ?a ?c_pre) (next ?c_pre ?c_post) (capacity-ok ?a ?c_post)
        (not (seismic-active ?l))
        (transportable ?i)
        (or (not (needs-cooling ?i)) (cooled ?i))
    )
    :effect (and 
        (not (at ?i ?l)) (holding ?a ?i)
        (not (load ?a ?c_pre)) (load ?a ?c_post)
    )
  )

  ;; Caso 2: Oggetto Caldo (Transportable MA Needs-Cooling e NOT Cooled)
  (:action pick-up-hot
    :parameters (?a - agent ?i - item ?l - location ?c_pre ?c_post - count)
    :precondition (and 
        (at ?a ?l) (at ?i ?l)
        (load ?a ?c_pre) (next ?c_pre ?c_post) (capacity-ok ?a ?c_post)
        (not (seismic-active ?l))
        (transportable ?i)
        (needs-cooling ?i) 
        (not (cooled ?i))
    )
    :effect (and 
        (not (at ?i ?l)) (holding ?a ?i)
        (not (load ?a ?c_pre)) (load ?a ?c_post)
        (temp-blocked ?a) ;; Ti scotti le mani -> non ti muovi
    )
  )

  ;; Caso 3: Oggetto Fragile (NON Transportable)
  (:action pick-up-fragile
    :parameters (?a - agent ?i - item ?l - location ?c_pre ?c_post - count ?p - pod)
    :precondition (and 
        (at ?a ?l) (at ?i ?l)
        (load ?a ?c_pre) (next ?c_pre ?c_post) (capacity-ok ?a ?c_post)
        (not (seismic-active ?l))
        (not (transportable ?i))
        ;; Vincolo Pod: Devi avere un pod vuoto in mano
        (holding ?a ?p) (empty ?p)
    )
    :effect (and 
        (not (at ?i ?l)) (holding ?a ?i)
        (not (load ?a ?c_pre)) (load ?a ?c_post)
        (blocked ?a) ;; Fragile -> non ti muovi
    )
  )

  ;; --- RILASCIO (SPLIT ACTIONS) ---
  
  ;; Rilascio Standard (Non rimuove blocchi perché non ce n'erano)
  (:action drop-standard
    :parameters (?a - agent ?i - item ?l - location ?c_pre ?c_post - count)
    :precondition (and 
        (at ?a ?l) (holding ?a ?i)
        (load ?a ?c_pre) (next ?c_post ?c_pre)
        (transportable ?i)
        (or (not (needs-cooling ?i)) (cooled ?i))
    )
    :effect (and 
        (at ?i ?l) (not (holding ?a ?i))
        (not (load ?a ?c_pre)) (load ?a ?c_post)
    )
  )

  ;; Rilascio Oggetto Caldo (Rimuove temp-blocked)
  (:action drop-hot
    :parameters (?a - agent ?i - item ?l - location ?c_pre ?c_post - count)
    :precondition (and 
        (at ?a ?l) (holding ?a ?i)
        (load ?a ?c_pre) (next ?c_post ?c_pre)
        (transportable ?i)
        (needs-cooling ?i) (not (cooled ?i))
    )
    :effect (and 
        (at ?i ?l) (not (holding ?a ?i))
        (not (load ?a ?c_pre)) (load ?a ?c_post)
        (not (temp-blocked ?a))
    )
  )

  ;; Rilascio Oggetto Fragile (Rimuove blocked)
  (:action drop-fragile
    :parameters (?a - agent ?i - item ?l - location ?c_pre ?c_post - count)
    :precondition (and 
        (at ?a ?l) (holding ?a ?i)
        (load ?a ?c_pre) (next ?c_post ?c_pre)
        (not (transportable ?i))
    )
    :effect (and 
        (at ?i ?l) (not (holding ?a ?i))
        (not (load ?a ?c_pre)) (load ?a ?c_post)
        (not (blocked ?a))
    )
  )

  ;; --- GESTIONE POD ---

  (:action load-pod
    :parameters (?a - agent ?art - item ?pod - item ?l - location ?c_pre ?c_post - count)
    :precondition (and 
        (at ?a ?l) (at ?pod ?l) (holding ?a ?art) (empty ?pod)
        (load ?a ?c_pre) (next ?c_post ?c_pre) 
        (not (seismic-active ?l))
    )
    :effect (and 
        (not (holding ?a ?art))
        (not (empty ?pod)) 
        (inside ?art ?pod)
        (not (load ?a ?c_pre)) (load ?a ?c_post)
        (not (blocked ?a)) ;; Loading rimuove sempre il blocco fisico
    )
  )

  ;; Unload Split: Standard vs Fragile
  
  (:action unload-pod-standard
    :parameters (?a - agent ?art - item ?pod - item ?l - location ?c_pre ?c_post - count)
    :precondition (and 
        (at ?a ?l) (at ?pod ?l) 
        (inside ?art ?pod)
        (load ?a ?c_pre) (next ?c_pre ?c_post) (capacity-ok ?a ?c_post) 
        (not (seismic-active ?l))
        (transportable ?art) ;; Se è robusto
    )
    :effect (and 
        (holding ?a ?art)
        (empty ?pod) (not (inside ?art ?pod))
        (not (load ?a ?c_pre)) (load ?a ?c_post)
    )
  )

  (:action unload-pod-fragile
    :parameters (?a - agent ?art - item ?pod - item ?l - location ?c_pre ?c_post - count)
    :precondition (and 
        (at ?a ?l) (at ?pod ?l) 
        (inside ?art ?pod)
        (load ?a ?c_pre) (next ?c_pre ?c_post) (capacity-ok ?a ?c_post) 
        (not (seismic-active ?l))
        (not (transportable ?art)) ;; Se è fragile
    )
    :effect (and 
        (holding ?a ?art)
        (empty ?pod) (not (inside ?art ?pod))
        (not (load ?a ?c_pre)) (load ?a ?c_post)
        (blocked ?a) ;; Diventi bloccato
    )
  )

  ;; --- RAFFREDDAMENTO ---
  (:action cool-down
    :parameters (?ag - agent ?a - artifact ?l - location)
    :precondition (and 
        (at ?ag ?l) 
        (holding ?ag ?a) 
        (needs-cooling ?a)
        (not (cooled ?a))
    )
    :effect (and 
        (cooled ?a)
        (not (temp-blocked ?ag)) ;; Rimuove il blocco termico
    )
  )
)

; problem
(define (problem imv-problem-2-final)
  (:domain imv-multi-agent)

  (:objects
    curator - robot
    drone1 - drone
    
    entrance tunnel hall_a hall_b cryo stasis pods_room - location
    
    art_alpha art_beta mars_core - artifact
    pod1 pod2 - pod
    
    n0 n1 n2 - count
  )

  (:init
    ;; Topologia
    (connected entrance tunnel) (connected tunnel entrance)
    (connected tunnel hall_a)   (connected hall_a tunnel)
    (connected tunnel hall_b)   (connected hall_b tunnel)
    (connected tunnel cryo)     (connected cryo tunnel)
    (connected tunnel stasis)   (connected stasis tunnel)
    (connected tunnel pods_room)(connected pods_room tunnel)

    ;; Stato Agenti
    (at curator entrance) (load curator n0)
    (at drone1 entrance)  (load drone1 n0)

    ;; Capacità: Il Drone e il Curator possono portare fino a 2 oggetti
    (capacity-ok drone1 n0) (capacity-ok drone1 n1) (capacity-ok drone1 n2)
    (capacity-ok curator n0) (capacity-ok curator n1) (capacity-ok curator n2)
    
    ;; Numeri
    (next n0 n1) (next n1 n2)

    ;; Oggetti e posizioni iniziali
    (at art_alpha hall_a)
    (at art_beta hall_b)
    (at mars_core cryo)
    (at pod1 pods_room) (empty pod1)
    (at pod2 pods_room) (empty pod2)

    ;; --- REGOLE DI TRASPORTABILITÀ ---
    (transportable pod1)
    (transportable pod2)
    (transportable art_alpha)
    (transportable mars_core)
    ;; NOTA: art_beta NON è presente qui -> fragile -> causa (blocked).

    ;; --- TEMPERATURA ---
    ;; Fix Critico: Ora art_alpha richiede raffreddamento prima del trasporto
    (needs-cooling art_alpha)

    ;; --- SISMICITÀ ---
    ;; (seismic-active hall_b) 
  )

  (:goal
    (and
      ;; 1. Art Beta portato allo Stasis Lab
      (at art_beta stasis)
      
      ;; 2. I Pod devono tornare al loro posto
      (at pod1 pods_room)
      (at pod2 pods_room)

      ;; 3. Art Alpha alla Cryo
      (at art_alpha cryo)

      ;; 4. Core Sample allo Stasis
      (at mars_core stasis)

      ;; 5. Ritorno alla base
      (at curator entrance)
      (at drone1 entrance)
    )
  )
)

; plan
1. (move-freely drone1 entrance tunnel)
   deleted: (at drone1 entrance)
   added: (at drone1 tunnel)
   goals met: 3 of 7
2. (move-freely drone1 tunnel pods_room)
   deleted: (at drone1 tunnel)
   added: (at drone1 pods_room)
   goals met: 3 of 7
3. (pick-up-standard drone1 pod1 pods_room n0 n1)
   deleted: (at pod1 pods_room) (load drone1 n0)
   added: (holding drone1 pod1) (load drone1 n1)
   goals met: 2 of 7
4. (move-carrying drone1 pods_room tunnel)
   deleted: (at drone1 pods_room)
   added: (at drone1 tunnel)
   goals met: 2 of 7
5. (move-carrying drone1 tunnel hall_b)
   deleted: (at drone1 tunnel)
   added: (at drone1 hall_b)
   goals met: 2 of 7
6. (pick-up-fragile drone1 art_beta hall_b n1 n2 pod1)
   deleted: (at art_beta hall_b) (load drone1 n1)
   added: (holding drone1 art_beta) (load drone1 n2) (blocked drone1)
   goals met: 2 of 7
7. (drop-standard drone1 pod1 hall_b n2 n1)
   deleted: (holding drone1 pod1) (load drone1 n2)
   added: (at pod1 hall_b) (load drone1 n1)
   goals met: 2 of 7
8. (load-pod drone1 art_beta pod1 hall_b n1 n0)
   deleted: (holding drone1 art_beta) (empty pod1) (load drone1 n1) (blocked drone1)
   added: (inside art_beta pod1) (load drone1 n0)
   goals met: 2 of 7
9. (pick-up-standard drone1 pod1 hall_b n0 n1)
   deleted: (at pod1 hall_b) (load drone1 n0)
   added: (holding drone1 pod1) (load drone1 n1)
   goals met: 2 of 7
10. (move-carrying drone1 hall_b tunnel)
   deleted: (at drone1 hall_b)
   added: (at drone1 tunnel)
   goals met: 2 of 7
11. (move-carrying drone1 tunnel hall_a)
   deleted: (at drone1 tunnel)
   added: (at drone1 hall_a)
   goals met: 2 of 7
12. (pick-up-hot drone1 art_alpha hall_a n1 n2)
   deleted: (at art_alpha hall_a) (load drone1 n1)
   added: (holding drone1 art_alpha) (load drone1 n2) (temp-blocked drone1)
   goals met: 2 of 7
13. (cool-down drone1 art_alpha hall_a)
   deleted: (temp-blocked drone1)
   added: (cooled art_alpha)
   goals met: 2 of 7
14. (move-carrying drone1 hall_a tunnel)
   deleted: (at drone1 hall_a)
   added: (at drone1 tunnel)
   goals met: 2 of 7
15. (move-carrying drone1 tunnel cryo)
   deleted: (at drone1 tunnel)
   added: (at drone1 cryo)
   goals met: 2 of 7
16. (drop-standard drone1 art_alpha cryo n2 n1)
   deleted: (holding drone1 art_alpha) (load drone1 n2)
   added: (at art_alpha cryo) (load drone1 n1)
   goals met: 3 of 7
17. (pick-up-standard drone1 mars_core cryo n1 n2)
   deleted: (at mars_core cryo) (load drone1 n1)
   added: (holding drone1 mars_core) (load drone1 n2)
   goals met: 3 of 7
18. (move-carrying drone1 cryo tunnel)
   deleted: (at drone1 cryo)
   added: (at drone1 tunnel)
   goals met: 3 of 7
19. (move-carrying drone1 tunnel stasis)
   deleted: (at drone1 tunnel)
   added: (at drone1 stasis)
   goals met: 3 of 7
20. (drop-standard drone1 pod1 stasis n2 n1)
   deleted: (holding drone1 pod1) (load drone1 n2)
   added: (at pod1 stasis) (load drone1 n1)
   goals met: 3 of 7
21. (unload-pod-fragile drone1 art_beta pod1 stasis n1 n2)
   deleted: (inside art_beta pod1) (load drone1 n1)
   added: (holding drone1 art_beta) (empty pod1) (load drone1 n2) (blocked drone1)
   goals met: 3 of 7
22. (drop-fragile drone1 art_beta stasis n2 n1)
   deleted: (holding drone1 art_beta) (load drone1 n2) (blocked drone1)
   added: (at art_beta stasis) (load drone1 n1)
   goals met: 4 of 7
23. (pick-up-standard drone1 pod1 stasis n1 n2)
   deleted: (at pod1 stasis) (load drone1 n1)
   added: (holding drone1 pod1) (load drone1 n2)
   goals met: 4 of 7
24. (drop-standard drone1 mars_core stasis n2 n1)
   deleted: (holding drone1 mars_core) (load drone1 n2)
   added: (at mars_core stasis) (load drone1 n1)
   goals met: 5 of 7
25. (move-carrying drone1 stasis tunnel)
   deleted: (at drone1 stasis)
   added: (at drone1 tunnel)
   goals met: 5 of 7
26. (move-carrying drone1 tunnel pods_room)
   deleted: (at drone1 tunnel)
   added: (at drone1 pods_room)
   goals met: 5 of 7
27. (drop-standard drone1 pod1 pods_room n1 n0)
   deleted: (holding drone1 pod1) (load drone1 n1)
   added: (at pod1 pods_room) (load drone1 n0)
   goals met: 6 of 7
28. (move-freely drone1 pods_room tunnel)
   deleted: (at drone1 pods_room)
   added: (at drone1 tunnel)
   goals met: 6 of 7
29. (move-freely drone1 tunnel entrance)
   deleted: (at drone1 tunnel)
   added: (at drone1 entrance)
   goals met: 7 of 7
